DAUoverset-7/tutorials/hollowCylinderWithBaseMesh/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1.5226 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet 
    {
        type    codedFixedValue;
        name    inlel2;
        value   uniform (1 0 0);

        code
        #{
            const List<vector> fC = this->patch().patch().faceCentres();
            Field<vector> value(fC.size());

            forAll(value,i)
                value[i] = vector(1,0,0) * (-1.25*fC[i].z()+1.09895875);

            operator==(value);

        #};
    }

    outlet 
    {
        type    zeroGradient;
    }

    side 
    {
        type    symmetry;
    }
    
    overset1
    {
        type    overset;
        value   uniform (1.5226 0 0);
    }
}


// ************************************************************************* //
