DAUoverset-7/tutorials/hollowCylinderWithBaseMesh/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    side 
    {
        type    symmetry;
    }

    inlet    
    {
        type    zeroGradient;
    }

    outlet 
    {
        type    fixedValue;
        value   uniform 0;
    }
 
    overset1
    {
        type    overset;  
        value   uniform 0;
    }
}


// ************************************************************************* //
